In [28]:
import pandas as pd

In [29]:
sr1 =pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [30]:
sr1[0]

np.int64(10)

In [31]:
sr1[3]

np.int64(40)

In [32]:
sr2 = pd.Series([10,20,30,40,50,60], index = ['a','b','c','d','e','f'] , dtype = float)
sr2

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
f    60.0
dtype: float64

In [33]:
sr2['c']

np.float64(30.0)

In [34]:
sr2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [35]:
sr2.values

array([10., 20., 30., 40., 50., 60.])

In [36]:
sr2.dtype

dtype('float64')

In [37]:
##DataFrame##

In [38]:
 dict1 = {
     'col1': [10,20,30,40,50],
     'col2': pd.Series(['a','b','c','d','e'])
 }
 df1 = pd.DataFrame(dict1)
 df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [39]:
output =df1.dtypes
output

col1     int64
col2    object
dtype: object

In [40]:
output.index

Index(['col1', 'col2'], dtype='object')

In [41]:
output.values

array([dtype('int64'), dtype('O')], dtype=object)

In [42]:
output.dtype

dtype('O')

In [43]:
type(output)

pandas.core.series.Series

In [44]:
##Merge##

In [53]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,99,98,91]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [92,90,94,89,95]})
df2

   id  ml_marks
0   3        92
1   4        90
2   5        94
3   6        89
4   7        95

In [54]:
df1 = pd.DataFrame({'id':[1,2,3,2,5], 'stat_marks': [94,95,9,49,96]})
df1

   id  stat_marks
0   1          94
1   2          95
2   3           9
3   2          49
4   5          96

In [55]:
df1.merge(df2, on= 'id',how = 'inner')

   id  stat_marks  ml_marks
0   3           9        92
1   5          96        94

In [56]:
df1.merge(df2, on= 'id',how = 'outer')

   id  stat_marks  ml_marks
0   1        94.0       NaN
1   2        95.0       NaN
2   2        49.0       NaN
3   3         9.0      92.0
4   4         NaN      90.0
5   5        96.0      94.0
6   6         NaN      89.0
7   7         NaN      95.0

In [57]:
df1.merge(df2, on= 'id',how = 'left')

   id  stat_marks  ml_marks
0   1          94       NaN
1   2          95       NaN
2   3           9      92.0
3   2          49       NaN
4   5          96      94.0

In [58]:
 df1.merge(df2, on= 'id',how = 'right')

   id  stat_marks  ml_marks
0   3         9.0        92
1   4         NaN        90
2   5        96.0        94
3   6         NaN        89
4   7         NaN        95

### Concat

In [59]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,99,98,91]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [92,90,94,89,95]})

In [60]:
pd.concat([df1,df2])

   id  stat_marks  ml_marks
0   1        94.0       NaN
1   2        95.0       NaN
2   3        99.0       NaN
3   4        98.0       NaN
4   5        91.0       NaN
0   3         NaN      92.0
1   4         NaN      90.0
2   5         NaN      94.0
3   6         NaN      89.0
4   7         NaN      95.0